clc;
clear;

% 定义期望目标，初始状态以及初始输入
x_t = [5; 0; 0; 0];
x_c = [0; 0; 0; 0];
u_c = [0];
% 拟合步长以及控制周期
n_step = 100;
Ts = 0.0001;
% 定义权重矩阵
Q = eye(4);
Q(1, 1) = 1;
Q(2, 2) = 1;
Q(3, 3) = 1;
Q(4, 4) = 1;
R = eye(1);
R(1, 1) = 1;

X_K(:, 1) = x_c;

% 设置状态空间矩阵
A = [
        -0.0665,11.5,0,0;...
        0,-2.5,2.5,0;...
        -9.5,0,-13.736,-13.736;...
        0.6,0,0,0
    ];
B = [0;0;13.736;0];
C = eye(4);
D = zeros(4,1);
% 系统离散化用于进行仿真预测
sys_c = ss(A, B, C, D);
sys_d = c2d(sys_c, Ts);

% 设置初始A矩阵
A_normal = [
        -0.0665,8,0,0;...
        0,-3.663,3.663,0;...
        -6.86,0,-13.736,-13.736;...
        0.6,0,0,0
    ];

K = ADP_noA_Iter(A, B, Q, R, A_normal, sys_d.A, sys_d.B, Ts, n_step);
disp(K);
K1 = lqr(A,B,Q,R);
disp(K1);